# Apps
cask "1password-cli"           # 1password integration
cask "appcleaner"              # for deleting apps
cask "arc"                     # browser
cask "chatgpt"                 # ChatGPT app
cask "github"                  # Github Desktop
cask "hammerspoon"             # for custom scripts
cask "hyperkey"                # hyperkey support
cask "kitty"                   # terminal
cask "raycast"                 # command center
cask "redis-insight"           # Redis GUI
cask "visual-studio-code"      # editor
cask "vlc"                     # video player
cask "zed"                     # editor
cask "zen"                     # browser

# CLIs
brew "atuin"                   # better shell history
brew "awscli"                  # AWS cli
brew "bandwhich"               # top for network
brew "bat"                     # fancier cat
brew "bottom"                  # better top
brew "carapace"                # better Nushell completions
brew "chezmoi"                 # managing dotfiles
brew "difftastic"              # syntax aware diffs
brew "direnv"                  # automatic loading of environment variables
brew "dive"                    # inspecing Docker images
brew "dust"                    # better disk usage
brew "eza"                     # better ls
brew "fd"                      # better find
brew "fdupes"                  # finds duplicate files
brew "fish"                    # shell, for completions
brew "fzf"                     # fuzzy completion
brew "gh"                      # github
brew "git"                     # vcs
brew "git-delta"               # better diffs
brew "helix"                   # better Vim
brew "helm"                    # kubernetes templating
brew "hyperfine"               # for benchmarking
brew "jj"                      # git-compatible VCS
brew "jq"                      # JSON processor
brew "just"                    # better make
brew "k9s"                     # k8s TUI
brew "kondo"                   # cleans up node_modules, etc. from projects
brew "kubectx"                 # for switching context and namespaces
brew "lazydocker"              # Docker TUI
brew "lazygit"                 # Git TUI
brew "mergiraf"                # syntaxt-aware merge tool
brew "minikube"                # for spinning k8s clusters
brew "mise"                    # tool version management
brew "mprocs"                  # run multiple commands in parallel
brew "noti"                    # notification popups
brew "nushell"                 # shell
brew "posting"                 # Postman-like TUI
brew "procs"                   # better ps
brew "ripgrep"                 # better grep
brew "ripgrep-all"             # ripgrep, but also PDFs, etc.
brew "rm-improved"             # safer rm
brew "sd"                      # better sed
brew "siderolabs/tap/talosctl" # Talos
brew "starship"                # better prompt
brew "stern"                   # kubernetes log
brew "talhelper"               # Talos GitOps
brew "tealdeer"                # command examples
brew "viddy"                   # watching command output
brew "xh"                      # HTTP client
brew "yq"                      # jq, but for YAML
brew "zoxide"                  # cd replacement

# Fonts
cask "font-fira-code-nerd-font"
