tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
brew "coreutils"
brew "asdf"
brew "atuin"
brew "bandwhich"
brew "bat"
brew "pycparser"
brew "cffi"
brew "chezmoi"
brew "croc"
brew "cryptography"
brew "difftastic"
brew "dive"
brew "dust"
brew "exa"
brew "fd"
brew "fdupes"
brew "fzf"
brew "libavif"
brew "gh"
brew "git"
brew "git-delta"
brew "gnutls"
brew "netpbm"
brew "harfbuzz"
brew "hcloud"
brew "helix"
brew "howdoi"
brew "hugo"
brew "hyperfine"
brew "jq"
brew "just"
brew "k9s"
brew "kubernetes-cli"
brew "kubeseal"
brew "lazydocker"
brew "lazygit"
brew "minikube"
brew "node"
brew "noti"
brew "procs"
brew "ripgrep"
brew "ripgrep-all"
brew "rm-improved"
brew "sd"
brew "skaffold"
brew "spotify-tui"
brew "starship"
brew "stern"
brew "tealdeer"
brew "viddy"
brew "wget"
brew "yq"
brew "zinit"
brew "zoxide"
brew "zx"
brew "koekeishiya/formulae/yabai"
cask "appcleaner"
cask "discord"
cask "docker"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "karabiner-elements"
cask "paw"
cask "redisinsight"
cask "tailscale"
cask "zed"
vscode "4ops.terraform"
vscode "antfu.theme-vitesse"
vscode "ardenivanov.svelte-intellisense"
vscode "bibhasdn.unique-lines"
vscode "bradlc.vscode-tailwindcss"
vscode "britesnow.vscode-toggle-quotes"
vscode "durzn.brackethighlighter"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "felipecaputo.git-project-manager"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "ionutvmi.path-autocomplete"
vscode "jasonnutter.vscode-codeowners"
vscode "leodevbro.blockman"
vscode "mechatroner.rainbow-csv"
vscode "miguelsolorio.symbols"
vscode "mikehhodgson.monochrome-dark"
vscode "monokai.theme-monokai-pro-vscode"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vsliveshare.vsliveshare"
vscode "pivaszbs.svelte-autoimport"
vscode "pkief.material-product-icons"
vscode "quicktype.quicktype"
vscode "redhat.vscode-yaml"
vscode "ryanluker.vscode-coverage-gutters"
vscode "skellock.just"
vscode "sleistner.vscode-fileutils"
vscode "sumneko.lua"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "usernamehw.errorlens"
vscode "virgilsisoe.hammerspoon"
vscode "yokoe.vscode-postfix-go"
