tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
brew "coreutils"
brew "asdf"
brew "atuin"
brew "bandwhich"
brew "bat"
brew "pycparser"
brew "cffi"
brew "chezmoi"
brew "croc"
brew "cryptography"
brew "difftastic"
brew "dive"
brew "dust"
brew "exa"
brew "fd"
brew "fdupes"
brew "fzf"
brew "libavif"
brew "gh"
brew "git"
brew "git-delta"
brew "gnutls"
brew "netpbm"
brew "harfbuzz"
brew "hcloud"
brew "helix"
brew "howdoi"
brew "hugo"
brew "hyperfine"
brew "jq"
brew "just"
brew "k9s"
brew "kubernetes-cli"
brew "kubeseal"
brew "lazydocker"
brew "lazygit"
brew "minikube"
brew "node"
brew "noti"
brew "procs"
brew "ripgrep"
brew "ripgrep-all"
brew "rm-improved"
brew "sd"
brew "skaffold"
brew "spotify-tui"
brew "starship"
brew "stern"
brew "tealdeer"
brew "viddy"
brew "wget"
brew "yq"
brew "zinit"
brew "zoxide"
brew "zx"
brew "koekeishiya/formulae/yabai"
cask "appcleaner"
cask "discord"
cask "docker"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "karabiner-elements"
cask "paw"
cask "redisinsight"
cask "tailscale"
cask "zed"
